# ==================================================
# 데이터 컬럼 정보
# ==================================================

cols = {
    # 기본정보
    'EXAMIN_YEAR': {'name': '조사연도', 'dtype': 'object'},
    'exmprs_no': {'name': '조사대상자번호', 'dtype': 'object'}, 
    'age': {'name': '만나이', 'dtype': 'float64'},
    'sex': {'name': '성별', 'dtype': 'object'},
    'CTPRVN_CODE': {'name': '시도번호', 'dtype': 'object'},
    'PBHLTH_CODE': {'name': '보건소번호', 'dtype': 'object'},
    'SPOT_NO': {'name': '표본지점번호', 'dtype': 'object'}, 
    'HSHLD_CODE': {'name': '가구번호', 'dtype': 'object'},
    'MBHLD_CODE': {'name': '가구원번호', 'dtype': 'object'}, 
    'DONG_TY_CODE': {'name': '동읍면구분', 'dtype': 'object'},
    'HOUSE_TY_CODE': {'name': '주택유형', 'dtype': 'object'},
    'signgu_code': {'name': '행정기관코드', 'dtype': 'object'},
    'kstrata': {'name': '층화변수', 'dtype': 'object'},
    'wt_h': {'name': '가구가중치', 'dtype': 'float64'}, 
    'wt_p': {'name': '개인가중치', 'dtype': 'float64'}, 
    'mbhld_co': {'name': '가구원수_전체', 'dtype': 'float64'},
    'reside_adult_co': {'name': '가구원수_만19세이상', 'dtype': 'float64'},

    # 가구조사
    'fma_19z3': {'name': '세대유형', 'dtype': 'object'},
    'fma_04z1': {'name': '기초생활수급자여부', 'dtype': 'object'}, 
    'fma_12z1': {'name': '가구총소득_기준기간', 'dtype': 'object'}, 
    'fma_13z1': {'name': '가구총소득_Y금액', 'dtype': 'float64'}, 
    'fma_14z1': {'name': '가구총소득_M금액', 'dtype': 'float64'}, 
    'fma_24z2': {'name': '가구총소득_월평균금액', 'dtype': 'float64'}, 
    'nue_01z1': {'name': '가구식품안정성여부', 'dtype': 'object'}, 
    'fma_27z1': {'name': '치매환자가구여부', 'dtype': 'object'},  
    'fma_26z1': {'name': '치매환자가족거주여부', 'dtype': 'object'}, 

    # 이탈여부
    'churn': {'name': '이탈여부', 'dtype': 'float64'} 
}

# ==================================================
# 코드 정보
# ==================================================

# 세대유형
fma_19z3_cd = {
    1: '1인가구',
    2: '부부(응답자+배우자)',
    3: '기타(상기를 제외한 모든 1세대 가구)',
    4: '부부+미혼자녀',
    5: '편부모+미혼자녀',
    6: '기타(상기를 제외한 모든 2세대 가구)',
    7: '모든 3세대 가구',
    77: '응답거부',
    99: '모름'
}

# 기초생활수급자여부
fma_04z1_cd = {
    1: '그렇다',
    2: '지금은 아니지만, 과거에 수급자였던 적이 있다',
    3: '아니다',
    7: '응답거부',
    9: '모름'
}

# 가구총소득기준기간
fma_12z1_cd = {
    1: '연',
    2: '월',
    7: '응답거부',
    9: '모름'
}

# 가구총소득월평균금액구간
fma_24z2_cd = {
    1: '50만원미만',
    2: '50-100만원미만',
    3: '100-200만원미만',
    4: '200-300만원미만',
    5: '300-400만원미만',
    6: '400-500만원미만',
    7: '500-600만원미만',
    8: '600만원이상',
    77: '응답거부',
    88: '비해당',
    99: '모름',
}

# 가구식품안정성여부
nue_01z1_cd = {
    1: '충분한 양과 다양한 종류의 음식을 먹을 수 있었다',
    2: '충분한 양의 음식을 먹을 수 있었으나, 다양한 종류의 음식은 먹지 못했다',
    3: '가끔 먹을 것이 부족했다',
    4: '자주 먹을 것이 부족했다',
    7: '응답거부',
    9: '모름'
}

# 치매환자가구여부
fma_27z1_cd = {
    1: '예',
    2: '아니오',
    7: '응답거부',
    9: '모름'
}

# 치매환자가족거주여부
fma_26z1_cd = {
    1: '예',
    2: '아니오',
    7: '응답거부',
    8: '비해당',
    9: '모름'
}

# ==================================================
# 코드 매핑 딕셔너리(변수명으로 접근)
# ==================================================
code_maps = {
    'fma_19z3': fma_19z3_cd,
    'fma_04z1': fma_04z1_cd,
    'fma_12z1': fma_12z1_cd,
    'fma_24z2': fma_24z2_cd,
    'nue_01z1': nue_01z1_cd,
    'fma_27z1': fma_27z1_cd,
    'fma_26z1': fma_26z1_cd
}